# -*- org-emphasis-alist: nil -*-

#+TITLE: Pathfinder Character Sheet
#+AUTHOR: Jesus Ramos

# Just fill in the relevant information in the tables and recalculate all tables
# if necessary
# M-x org-table-recalculate-buffer-tables

* Basic Character Info
  - Name :: Tsardok
  - Race :: Half-Orc
  - Gender :: Male
  - Height :: 6ft
  - Weight :: 172lbs
  - Age :: 25
  - Alignment :: Lawful Good
  - Deity :: Shelyn
  - Background Occupation :: Being awesome
  - Languages :: Common, Orc

  #+NAME:Size
  |------------|
  | Size Bonus |
  |------------|
  |          0 |
  |------------|

* Character Stats
  #+NAME:Stats
  |---+--------------+-------+----------+------+----------+---------+------|
  | ! | Stat         | Total | Modifier | Base | Inherent | Enhance | Misc |
  |---+--------------+-------+----------+------+----------+---------+------|
  | # | Strength     |    17 |        3 |   14 |        3 |         |      |
  | # | Dexterity    |    10 |        0 |   10 |          |         |      |
  | # | Constitution |    14 |        2 |   14 |          |         |      |
  | # | Intelligence |    10 |        0 |   10 |          |         |      |
  | # | Wisdom       |    10 |        0 |   10 |          |         |      |
  | # | Charisma     |    14 |        2 |   14 |          |         |      |
  |---+--------------+-------+----------+------+----------+---------+------|
  #+TBLFM: @2$3..@2$3=vsum($5..$8)::@2$4..@7$4=floor(($3 - 10) / 2)

  #+NAME:Initiative
  |---+------------+-------+------+------|
  | ! |            | Total | Base | Misc |
  |---+------------+-------+------+------|
  | # | Initiative |     0 |    0 |    0 |
  |---+------------+-------+------+------|
  #+TBLFM: @2$3=vsum(@2$4..@2$5)::@2$4=remote(Stats, @3$Modifier)

* Class
  # Just hit TAB on the last row to recalculate when adding a new class
  #+NAME:Class
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  | ! |     HP | HD  | Class Name    | BAB | Skills | Fort | Ref | Will | Levels |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  |   |     49 | d10 | Paladin       |   5 |     10 |    4 |   1 |    4 |      5 |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  |   | Totals |     | Favored Class |     |        |      |     |      |        |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  | # |     49 |     | Paladin       |   5 |     10 |    4 |   1 |    4 |      5 |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  #+TBLFM: @>$2=vsum(@2..@-2)::@>$5..@>$10=vsum(@2..@-2)

  #+NAME:Experience
  |------------+---|
  | Experience |   |
  |------------+---|

  #+NAME:Feats
  |--------------------+--------------------------|
  | Name               | Description              |
  |--------------------+--------------------------|
  | Lightning Reflexes | +2 reflex saves          |
  | Extra Lay on Hands | +2 uses of Lay on Hands  |
  | Power Attack       | -2 attack +4 (+6 2h) dmg |
  |--------------------+--------------------------|

  #+NAME:Features
  |--------------------+-----------------------------------------------------|
  | Name               | Description                                         |
  |--------------------+-----------------------------------------------------|
  | Darkvision         | 60ft darkvision                                     |
  | Intimidating       | +2 intimidate checks                                |
  | Orc Ferocity       | Once a day can continue fighting at 0hp for 1 round |
  | Weapon Familiarity | Greataxe, Falchion, orc weapons                     |
  |--------------------+-----------------------------------------------------|

  #+NAME:ClassFeatures
  |-----------------+-----------------------------------------------------------------|
  | Name            | Description                                                     |
  |-----------------+-----------------------------------------------------------------|
  | Aura of Good    |                                                                 |
  | Detect Evil     |                                                                 |
  | Smite Evil      |                                                                 |
  | Divine Grace    | +Charisma on saving throws                                      |
  | Lay on Hands    |                                                                 |
  | Aura of Courage | Immune to fear, allys within 10ft gain +4 bonus on fear effects |
  | Divine Health   | Immune to diseases                                              |
  | Mercy           | Remove fatigue                                                  |
  |-----------------+-----------------------------------------------------------------|

* Defense
  #+NAME:Saves
  |---+---------------+-------+------+---------+---------+------|
  | ! | Saving Throws | Total | Base | Ability | Enhance | Misc |
  |---+---------------+-------+------+---------+---------+------|
  | # | Fortitude     |     9 |    4 |       2 |       3 |      |
  | # | Reflex        |     7 |    1 |       0 |       3 |    3 |
  | # | Will          |     7 |    4 |       0 |       3 |      |
  |---+---------------+-------+------+---------+---------+------|
  #+TBLFM: $5=remote(Stats,@3$Modifier)::@2$3..@4$3=vsum($4..$7)::@2$4=remote(Class, @>$Fort)::@2$5=remote(Stats, @4$Modifier)::@3$4=remote(Class, @>$Ref)::@4$4=remote(Class, @>$Will)::@4$5=remote(Stats, @6$Modifier)

  #+NAME:HP
  |---+--------------+----|
  | # | Base         | 49 |
  |   | Temporary HP |    |
  |---+--------------+----|
  | # | Total        | 49 |
  |---+--------------+----|
  #+TBLFM: @1$3=remote(Class, @2$HP)::@3$3=@1$3+@2$3

  #+NAME:AC
  |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
  | ! | Type      | Total | Base | Armor | Shield | Dex | Size | Dodge | Natural | Deflect | Misc |
  |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
  | # | AC        |    22 |   10 |     8 | 2      |   0 |    0 |       |       1 |       1 |      |
  | # | Touch     |    11 |   10 |   N/A | N/A    |   0 |    0 |       |     N/A |       1 |      |
  | # | Flat-foot |    20 |   10 |     8 | N/A    | N/A |    0 | N/A   |       1 |       1 |      |
  |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
  #+TBLFM: @2$3..@>$3=vsum($4..$12);N::@2$5=remote(Armor, @2$AC)::@2$6=remote(Armor, @3$AC)::@2$7..@3$7=min(remote(Stats, @3$Modifier), remote(Armor, @>$6)::@2$8..@>$8=remote(Size, @2$1)::@4$5=remote(Armor, @2$AC)

  #+NAME:CMD
  |---+-----+-------+------+-----+-----+-----+------+------|
  | ! |     | Total | Base | BAB | Dex | Str | Size | Misc |
  |---+-----+-------+------+-----+-----+-----+------+------|
  | # | CMD |    18 |   10 |   5 |   0 |   3 |    0 |      |
  |---+-----+-------+------+-----+-----+-----+------+------|
  #+TBLFM: @2$3=vsum($4..$9)::@2$5=remote(Class, @>$BAB)::@2$6=remote(Stats, @3$Modifier)::@2$7=remote(Stats, @2$Modifier)::@2$8=remote(Size, @2$1)

  #+NAME:Resistances
  |------------------+---|
  | Damage Reduction |   |
  | Spell Resistance |   |
  |------------------+---|

* Attacks
  #+NAME:Attacks
  |---+--------+-------+-------------------+---------+------+------|
  | ! |        | Total | Base Attack Bonus | Ability | Size | Misc |
  |---+--------+-------+-------------------+---------+------+------|
  | # | Melee  |     8 |                 5 |       3 |    0 |      |
  | # | Ranged |     5 |                 5 |       0 |    0 |      |
  | # | CMB    |     8 |                 5 |       3 |    0 |      |
  |---+--------+-------+-------------------+---------+------+------|
  #+TBLFM: @2$3..@4$3=vsum($4..$7)::@2$4..@4$4=remote(Class, @>$BAB)::@2$5=remote(Stats, @2$Modifier)::@2$6=remote(Size, @2$1)::@3$5=remote(Stats, @3$Modifier)::@3$6=remote(Size, @2$1)::@4$5=remote(Stats, @2$Modifier)::@4$6=remote(Size, @2$1)

  #+NAME:Weapons
  |---+----------------------+---------+------------------+----------+----------+-------+------+-------+-------|
  | ! | Weapon               | Enhance | Attack Modifiers | Damage   | Crit     | Range | Size | Type  | Notes |
  |---+----------------------+---------+------------------+----------+----------+-------+------+-------+-------|
  |   | Masterwork Glaive    |         |               +9 | 1d10 + 4 | x3       | 10ft  |      | S     | Reach |
  |   | Composite Longbow    |         |               +5 | 1d8      | x3       | 70ft  |      | P     |       |
  |   | Longsword            |       1 |               +9 | 1d8 + 4  | 19-20/x2 |       |      | S     |       |
  |   | Adamantine Longsword |         |               +8 | 1d8 + 3  | 19-20/x2 |       |      | S     |       |
  |   | Morningstar          |         |               +8 | 1d8 + 3  | x2       |       |      | B & P |       |
  |---+----------------------+---------+------------------+----------+----------+-------+------+-------+-------|

** Attacking Notes
   - Lay on Hands :: 2d6
   - Power attack :: -2 attack +4 (+6 2h) damage

* Skills
  # To mark as a class skill just put a 1 in the class column, org mode doesn't
  # support checkboxes in tables yet. You can add or change the ability the
  # stat depends on by modifying the Stat column. If a skill is affected by
  # armor penalty just mark it with a 1 in the Armor Penalty column
  #+NAME:Skills
  |---+-------------------+---------------+-------+---------------------+------+--------+-------+---------+---------+------|
  | ! | Training Required | Armor Penalty | Class | Skill               | Stat |  Total | Ranks | Ability | Trained | Misc |
  |---+-------------------+---------------+-------+---------------------+------+--------+-------+---------+---------+------|
  | # |                   |             1 |       | Acrobatics          | Dex  |     -8 |       |       0 |         |      |
  | # |                   |               |       | Appraise            | Int  |      0 |       |       0 |         |      |
  | # |                   |               |       | Bluff               | Cha  |      2 |       |       2 |         |      |
  | # |                   |             1 |       | Climb               | Str  |     -5 |       |       3 |         |      |
  | # |                   |               |     1 | Craft:              | Int  |      0 |       |       0 |         |      |
  | # |                   |               |     1 | Craft:              | Int  |      0 |       |       0 |         |      |
  | # |                   |               |     1 | Diplomacy           | Cha  |     10 |     5 |       2 |       3 |      |
  | # |                 1 |             1 |       | Disable Device      | Dex  |      - |       |       0 |         |      |
  | # |                   |               |       | Disguise            | Cha  |      2 |       |       2 |         |      |
  | # |                   |             1 |       | Escape Artist       | Dex  |     -8 |       |       0 |         |      |
  | # |                   |             1 |       | Fly                 | Dex  |     -8 |       |       0 |         |      |
  | # |                 1 |               |     1 | Handle Animal       | Cha  |      8 |     3 |       2 |       3 |      |
  | # |                   |               |     1 | Heal                | Wis  |      0 |       |       0 |         |      |
  | # |                   |               |       | Intimidate          | Cha  |      4 |       |       2 |         |    2 |
  | # |                 1 |               |     1 | Knowledge: Nobility | Int  |      4 |     1 |       0 |       3 |      |
  | # |                 1 |               |     1 | Knowledge: Religion | Int  |      4 |     1 |       0 |       3 |      |
  | # |                 1 |               |       | Linguistics         | Int  |      - |       |       0 |         |      |
  | # |                   |               |       | Perception          | Wis  |      0 |       |       0 |         |      |
  | # |                   |               |       | Perform:            | Cha  |      2 |       |       2 |         |      |
  | # |                 1 |               |     1 | Profession:         | Wis  |      - |       |       0 |         |      |
  | # |                   |             1 |     1 | Ride                | Dex  |     -8 |       |       0 |         |      |
  | # |                   |               |     1 | Sense Motive        | Wis  |      0 |       |       0 |         |      |
  | # |                 1 |             1 |       | Sleight of Hand     | Dex  |      - |       |       0 |         |      |
  | # |                 1 |               |     1 | Spellcraft          | Int  |      - |       |       0 |         |      |
  | # |                   |             1 |       | Stealth             | Dex  |     -8 |       |       0 |         |      |
  | # |                   |               |       | Survival            | Wis  |      0 |       |       0 |         |      |
  | # |                   |             1 |       | Swim                | Str  |     -5 |       |       3 |         |      |
  | # |                 1 |               |       | Use Magic Device    | Cha  |      - |       |       2 |         |      |
  |---+-------------------+---------------+-------+---------------------+------+--------+-------+---------+---------+------|
  | # |                   |               |       |                     |      | Total: |    10 |         |         |      |
  |---+-------------------+---------------+-------+---------------------+------+--------+-------+---------+---------+------|
  #+TBLFM: @II$7..@III$7=if(($2 > 0 && $8 > 0) || ($2 == 0) ,vsum($8..$11)+($3*remote(Armor, @>$Penalty)), string("-"))::@II$9..@III$9='(cond ((string= $6 "Str") remote(Stats, @2$Modifier)) ((string= $6 "Dex") remote(Stats, @3$Modifier)) ((string= $6 "Int") remote(Stats, @5$Modifier)) ((string= $6 "Wis") remote(Stats, @6$Modifier)) ((string= $6 "Cha") remote(Stats, @7$Modifier)))::@II$10..@III$10=if($4 > 0 && $8 > 0, 3, string(""))::@>$8=vsum(@2$8..@-1$8)

* Inventory

** Equipment
   # Just add new rows for new items
   #+NAME:Equipment
   |---+--------------------------------------+----------+---------------|
   | ! | Name                                 | Quantity |        Weight |
   |---+--------------------------------------+----------+---------------|
   |   | Half-Plate Armor                     |          |            50 |
   |   | Heavy Steel Shield                   |          |            15 |
   |   | Longsword (+1)                       |          |             4 |
   |   | Adamantine Longsword                 |          |             4 |
   |   | Composite Shortbow                   |          |             2 |
   |   | Arrows                               |       14 |             3 |
   |   | Masterwork Glaive                    |          |            10 |
   |   | Scroll Case                          |          |             1 |
   |   | Waterproof Bag                       |          |           0.5 |
   |   | Elf Bane Arrows (+1)                 |        2 |               |
   |   | Composite Longbow                    |          |               |
   |   | Masterwork Composite Longbow (Str+4) |          |               |
   |   | Morningstar                          |          |             6 |
   |---+--------------------------------------+----------+---------------|
   |   |                                      |          | Total Weight: |
   |---+--------------------------------------+----------+---------------|
   | # |                                      |          |          95.5 |
   |---+--------------------------------------+----------+---------------|
   #+TBLFM: @>$4=vsum(@2$4..@-2$4)

   # Worn magic items
   #+NAME:WornEquipment
   |-----------+------------------------------|
   | Head      |                              |
   | Face      |                              |
   | Throat    | Amulet of Natural Armor (+1) |
   | Shoulders | Cloak of Resistance (+1)     |
   | Body      |                              |
   | Torso     |                              |
   | Arms      |                              |
   | Hands     |                              |
   | Ring      | Ring of Protection (+1)      |
   | Ring      |                              |
   | Waist     |                              |
   | Feet      |                              |
   |-----------+------------------------------|

   #+NAME:Armor
   |---+---------+------------------------+---------+----+---------+---------+----------------+------+------+----------|
   | ! | Type    | Name                   | Enhance | AC | Max Dex | Penalty | Spell Fail (%) | Type | Size | Material |
   |---+---------+------------------------+---------+----+---------+---------+----------------+------+------+----------|
   |   | Armor   | Half-Plate             |         |  8 |       0 |      -7 |             40 |      | M    |          |
   |   | Shield  | Masterwork Heavy Steel |         |  2 |         |      -1 |             15 |      | M    |          |
   |---+---------+------------------------+---------+----+---------+---------+----------------+------+------+----------|
   | # | Totals: |                        |         | 10 |       0 |      -8 |             55 |      |      |          |
   |---+---------+------------------------+---------+----+---------+---------+----------------+------+------+----------|
   #+TBLFM: @4$5=vsum(@2$5..@-1$5)::@4$6=@2$6::@4$7=vsum(@2$7..@-1$7)::@4$8=vsum(@2$8..@-1$8)

** Magic Items
   #+NAME:MagicItems
   |--------------------------------+---------+--------------|
   | Item                           | Charges | Caster Level |
   |--------------------------------+---------+--------------|
   | Scroll of Challenge Evil       |       2 | 4            |
   | Potion of Enlarge Person       |       1 | min          |
   | Potion of Cure Moderate Wounds |       1 | min          |
   |--------------------------------+---------+--------------|

** Wealth
   #+NAME:Wealth
   |----------+------|
   | Platinum |      |
   | Gold     | 1519 |
   | Silver   |    3 |
   | Copper   |    2 |
   |----------+------|

** Bags and Containers
   #+NAME:Bags
   |-----------+--------+--------|
   | Container | Volume | Weight |
   |-----------+--------+--------|
   |           |        |        |
   |-----------+--------+--------|

* Spells
  #+NAME:CastingStat
  |---+--------------+-----+---|
  | # | Casting Stat | Cha | 2 |
  |---+--------------+-----+---|
  #+TBLFM:@1$4='(cond ((string= $3 "Int") remote(Stats, @5$Modifier)) ((string= $3 "Wis") remote(Stats, @6$Modifier)) ((string= $3 "Cha") remote(Stats, @7$Modifier)))

  #+NAME:SpellInfo
  |---+---------+-------------+-------+-------------+---------+------+-------------|
  | ! | Save DC | Spell Level | Total | Class Bonus | Ability | Misc | Total Known |
  |---+---------+-------------+-------+-------------+---------+------+-------------|
  | # |         |           0 |       |             |         |      |             |
  | # |      13 |           1 |     2 |           1 |       1 |      |             |
  | # |         |           2 |       |             |       1 |      |             |
  | # |         |           3 |       |             |       0 |      |             |
  | # |         |           4 |       |             |       0 |      |             |
  | # |         |           5 |       |             |       0 |      |             |
  | # |         |           6 |       |             |       0 |      |             |
  | # |         |           7 |       |             |       0 |      |             |
  | # |         |           8 |       |             |       0 |      |             |
  | # |         |           9 |       |             |       0 |      |             |
  |---+---------+-------------+-------+-------------+---------+------+-------------|
  #+TBLFM: $4=if($5 > 0, vsum($5..$8), string(""))::$2=if($4 > 0, 10+$3+remote(CastingStat, @1$4), string(""))::@3$6..@>$6=max(0, (remote(CastingStat, @1$4)-$3)\4+1)

  #+NAME:CasterLevel
  |--------------+---|
  | Caster Level | 2 |
  |--------------+---|

  #+NAME:Concentration
  |---+---------------+-------+------+---------+------|
  | ! |               | Total | Base | Ability | Misc |
  |---+---------------+-------+------+---------+------|
  | # | Concentration |     4 |    2 |       2 |      |
  |---+---------------+-------+------+---------+------|
  #+TBLFM: @2$3=vsum($4..$6)::@2$4=remote(CasterLevel, @1$2)::@2$5=remote(CastingStat, @1$4)

  #+NAME:SpellRanges
  |---+--------+-----|
  | # | Close  |  30 |
  | # | Medium | 120 |
  | # | Long   | 480 |
  |---+--------+-----|
  #+TBLFM: @1$3=25+remote(CasterLevel, @1$2)*5/2::@2$3=100+remote(CasterLevel, @1$2)*10::@3$3=400+remote(CasterLevel, @1$2)*40

  #+NAME:Spells
  |------------+-------+-------------------------+-------------+---------|
  | # Prepared | Level | Name                    | Description | Save DC |
  |------------+-------+-------------------------+-------------+---------|
  |            |     1 | [[http://paizo.com/pathfinderRPG/prd/advanced/spells/veilofPositiveEnergy.html][Veil of Positive Energy]] |             |         |
  |            |     1 | [[http://paizo.com/pathfinderRPG/prd/spells/protectionFromEvil.html#_protection-from-evil][Protection From Evil]]    |             |         |
  |            |     1 | [[http://paizo.com/pathfinderRPG/prd/spells/divineFavor.html#_divine-favor][Divine Favor]]            |             |         |
  |------------+-------+-------------------------+-------------+---------|

** Special Abilities
   #+NAME:SpecialAbilities
   |-------------------------+------------------------|
   | Name                    |               Uses/Day |
   |-------------------------+------------------------|
   | [[http://paizo.com/pathfinderRPG/prd/classes/paladin.html#_smite-evil][Smite Evil]]              |                      2 |
   | [[http://paizo.com/pathfinderRPG/prd/classes/paladin.html#_lay-on-hands][Lay on Hands]]            |                      6 |
   | [[http://paizo.com/pathfinderRPG/prd/advancedRaceGuide/coreRaces/halfOrcs.html#_orc-ferocity][Orc Ferocity]]            |                      1 |
   | [[http://paizo.com/pathfinderRPG/prd/classes/paladin.html#_channel-positive-energy-paladin][Channel Positive Energy]] | 2 uses of Lay on Hands |
   |-------------------------+------------------------|
